{"meta":{"title":"Global OEM","subtitle":"","description":"","author":"Any Electronics Co.,Ltd.","url":"https://global-oem.com","root":"/"},"pages":[{"title":"About Me","date":"2025-10-30T03:34:27.000Z","updated":"2025-10-30T06:00:25.690Z","comments":true,"path":"about/index.html","permalink":"https://global-oem.com/about/index.html","excerpt":"","text":"Thank you for visiting my blog. My name is Young Ke, and I am from China. I specialize in helping you with the development and production of electrical appliances. My Original IntentionMy original intention is to help you address the addition of new product features and the development of new products. This will make the products more in line with the needs of the local market, thereby achieving the best customer satisfaction. My Core Service AreasSince 2000, I have been focusing on the development and production of electrical products. I have mature development and production solutions for the control circuits of products such as time relays, timing switches, voltage protectors, current protectors, Type B residual current circuit breakers (RCBs), arc-fault circuit interrupters (AFCIs), and automatic recloser circuit breakers. How I Can Help YouAfter receiving your document outlining the analysis of product functions and intended objectives, I will assess the feasibility of the functions and propose a development plan. This will enable you to obtain the workflow and timeline for new product development in the shortest possible time. My Current Service RegionsMy current service regions include the North American market, the South American market, the European market, and the Middle Eastern market. Contact Me Home: Any Electronics Co.,Ltd. Email: fuyang.ke@timer-switch.com &amp;&amp; anyrelay@outlook.com GitHub: AnyElec Linkedin: AnyElec FaceBook: AnyElec"}],"posts":[{"title":"Hello World","slug":"hello-world","date":"2025-10-28T07:56:57.392Z","updated":"2025-10-28T07:56:57.392Z","comments":true,"path":"2025/10/28/hello-world/","permalink":"https://global-oem.com/2025/10/28/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[]}